## 🏗️ Terraform Plan Summary

| Step | Status |
|------|:------:|
| 🖌 Format & Style | ✅ `success` |
| ⚙️ Initialization | ✅ `success` |
| 🤖 Validation | ✅ `success` |
| 📖 Plan | ✅ `success` |

<details><summary>Validation Output</summary>

```
Success! The configuration is valid.
```

</details>

<details><summary>Plan Output</summary>

```terraform
data.terraform_remote_state.main: Reading...
random_id.bucket_suffix: Refreshing state... [id=MCNDqQ]
data.terraform_remote_state.main: Read complete after 1s
google_service_account.app: Refreshing state... [id=projects/doug-hayden-eng-sandbox/serviceAccounts/adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_vertex_ai_reasoning_engine.session_and_memory: Refreshing state... [id=projects/doug-hayden-eng-sandbox/locations/us-central1/reasoningEngines/1909328329912090624]
google_storage_bucket.artifact_service: Refreshing state... [id=artifact-service-adk-docker-uv-302343a9]
google_project_iam_member.app["roles/aiplatform.user"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/aiplatform.user/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/telemetry.tracesWriter"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/telemetry.tracesWriter/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/serviceusage.serviceUsageConsumer"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/serviceusage.serviceUsageConsumer/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/logging.logWriter"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/logging.logWriter/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/cloudtrace.agent"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/cloudtrace.agent/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.objectUser"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/storage.objectUser/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.bucketViewer"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/storage.bucketViewer/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_cloud_run_v2_service.app["us-central1"]: Refreshing state... [id=projects/doug-hayden-eng-sandbox/locations/us-central1/services/adk-docker-uv]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_v2_service.app["us-central1"] must be replaced
-/+ resource "google_cloud_run_v2_service" "app" {
      - annotations             = {} -> null
      ~ conditions              = [
          - {
              - last_transition_time = "2025-11-26T23:55:51.171936Z"
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "RoutesReady"
                # (5 unchanged attributes hidden)
            },
          - {
              - last_transition_time = "2025-11-26T23:53:57.614588Z"
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "ConfigurationsReady"
                # (5 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ create_time             = "2025-11-25T17:54:16.212407Z" -> (known after apply)
      ~ creator                 = "repo:doughayden/adk-docker-uv:ref:refs/heads/main (projects/136454482223/locations/global/workloadIdentityPools/adk-docker-uv-github)" -> (known after apply)
      - custom_audiences        = [] -> null
      - default_uri_disabled    = false -> null
      + delete_time             = (known after apply)
      ~ effective_annotations   = {} -> (known after apply)
      ~ effective_labels        = {
          + "application"                = "adk-docker-uv"
          + "environment"                = "default"
            # (1 unchanged element hidden)
        }
      ~ etag                    = ""CJSmnskGEJiFxNEC/cHJvamVjdHMvZG91Zy1oYXlkZW4tZW5nLXNhbmRib3gvbG9jYXRpb25zL3VzLWNlbnRyYWwxL3NlcnZpY2VzL2Fkay1kb2NrZXItdXY"" -> (known after apply)
      + expire_time             = (known after apply)
      ~ generation              = "15" -> (known after apply)
      ~ id                      = "projects/doug-hayden-eng-sandbox/locations/us-central1/services/adk-docker-uv" -> (known after apply)
      - invoker_iam_disabled    = false -> null
      ~ labels                  = {
          + "application" = "adk-docker-uv"
          + "environment" = "default"
        }
      ~ last_modifier           = "repo:doughayden/adk-docker-uv:ref:refs/heads/main (projects/136454482223/locations/global/workloadIdentityPools/adk-docker-uv-github)" -> (known after apply)
      ~ latest_created_revision = "projects/doug-hayden-eng-sandbox/locations/us-central1/services/adk-docker-uv/revisions/adk-docker-uv-00011-5l8" -> (known after apply)
      ~ latest_ready_revision   = "projects/doug-hayden-eng-sandbox/locations/us-central1/services/adk-docker-uv/revisions/adk-docker-uv-00011-5l8" -> (known after apply)
      ~ name                    = "adk-docker-uv" -> "adk-docker-uv-default" # forces replacement
      ~ observed_generation     = "15" -> (known after apply)
      ~ reconciling             = false -> (known after apply)
      ~ terminal_condition      = [
          - {
              - last_transition_time = "2025-11-26T23:55:51.216324Z"
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "Ready"
                # (5 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ terraform_labels        = {
          + "application"                = "adk-docker-uv"
          + "environment"                = "default"
            # (1 unchanged element hidden)
        }
      ~ traffic_statuses        = [
          - {
              - percent  = 100
              - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
                # (3 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ uid                     = "0ef7d593-bd43-49c1-af09-7fd1da72acf1" -> (known after apply)
      ~ update_time             = "2025-11-26T23:53:56.707855Z" -> (known after apply)
      ~ uri                     = "https://adk-docker-uv-645mxjt3sq-uc.a.run.app" -> (known after apply)
      ~ urls                    = [
          - "https://adk-docker-uv-136454482223.us-central1.run.app",
          - "https://adk-docker-uv-645mxjt3sq-uc.a.run.app",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
            # (2 unchanged attributes hidden)
        }

      ~ template {
          - annotations                      = {} -> null
          - gpu_zonal_redundancy_disabled    = false -> null
          - health_check_disabled            = false -> null
          - labels                           = {} -> null
          ~ service_account                  = "adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> "adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
          - session_affinity                 = false -> null
            # (5 unchanged attributes hidden)

          ~ containers {
              - args           = [] -> null
              ~ build_info     = [] -> (known after apply)
              - command        = [] -> null
              - depends_on     = [] -> null
              ~ image          = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/adk-docker-uv/adk-docker-uv@sha256:91a20700a9e06f073e2d386a1687d8353bff9cb78580ad869d489365833d2227" -> "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/adk-docker-uv/adk-docker-uv@sha256:468f9b891cb518e87342ea39dcae49699fb752001ad38441d0cc52aea2d569cb"
                name           = null
                # (2 unchanged attributes hidden)

              - env {
                  - name  = "ARTIFACT_SERVICE_URI" -> null
                  - value = "gs://artifact-service-adk-docker-uv-302343a9" -> null
                }
              + env {
                  + name  = "ARTIFACT_SERVICE_URI"
                  + value = (known after apply)
                }
              + env {
                  + name  = "TELEMETRY_NAMESPACE"
                  + value = "default"
                }

              ~ resources {
                  - startup_cpu_boost = false -> null
                    # (2 unchanged attributes hidden)
                }

                # (13 unchanged blocks hidden)
            }

          ~ scaling (known after apply)
          - scaling {
              - max_instance_count = 100 -> null
              - min_instance_count = 0 -> null
            }
        }

      ~ traffic (known after apply)
      - traffic {
          - percent  = 100 -> null
          - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # google_project_iam_member.app["roles/aiplatform.user"] must be replaced
-/+ resource "google_project_iam_member" "app" {
      ~ etag    = "BwZEcxd8Yn4=" -> (known after apply)
      ~ id      = "doug-hayden-eng-sandbox/roles/aiplatform.user/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> "serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_iam_member.app["roles/cloudtrace.agent"] must be replaced
-/+ resource "google_project_iam_member" "app" {
      ~ etag    = "BwZEcxd8Yn4=" -> (known after apply)
      ~ id      = "doug-hayden-eng-sandbox/roles/cloudtrace.agent/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> "serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_iam_member.app["roles/logging.logWriter"] must be replaced
-/+ resource "google_project_iam_member" "app" {
      ~ etag    = "BwZEcxd8Yn4=" -> (known after apply)
      ~ id      = "doug-hayden-eng-sandbox/roles/logging.logWriter/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> "serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_iam_member.app["roles/serviceusage.serviceUsageConsumer"] must be replaced
-/+ resource "google_project_iam_member" "app" {
      ~ etag    = "BwZEcxd8Yn4=" -> (known after apply)
      ~ id      = "doug-hayden-eng-sandbox/roles/serviceusage.serviceUsageConsumer/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> "serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_iam_member.app["roles/storage.bucketViewer"] must be replaced
-/+ resource "google_project_iam_member" "app" {
      ~ etag    = "BwZEcxd8Yn4=" -> (known after apply)
      ~ id      = "doug-hayden-eng-sandbox/roles/storage.bucketViewer/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> "serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_iam_member.app["roles/storage.objectUser"] must be replaced
-/+ resource "google_project_iam_member" "app" {
      ~ etag    = "BwZEcxd8Yn4=" -> (known after apply)
      ~ id      = "doug-hayden-eng-sandbox/roles/storage.objectUser/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> "serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_iam_member.app["roles/telemetry.tracesWriter"] must be replaced
-/+ resource "google_project_iam_member" "app" {
      ~ etag    = "BwZEcxd8Yn4=" -> (known after apply)
      ~ id      = "doug-hayden-eng-sandbox/roles/telemetry.tracesWriter/serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> "serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_service_account.app must be replaced
-/+ resource "google_service_account" "app" {
      ~ account_id   = "adk-docker-uv" -> "adk-docker-uv-default" # forces replacement
      ~ description  = "adk-docker-uv Cloud Run service-attached service account" -> "Service account attached to the adk-docker-uv-default Cloud Run service"
      ~ display_name = "adk-docker-uv Service Account" -> "adk-docker-uv-default Service Account"
      ~ email        = "adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> "adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      ~ id           = "projects/doug-hayden-eng-sandbox/serviceAccounts/adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> (known after apply)
      ~ member       = "serviceAccount:adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> "serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      ~ name         = "projects/doug-hayden-eng-sandbox/serviceAccounts/adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> (known after apply)
      ~ unique_id    = "103300911039698861948" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_storage_bucket.artifact_service must be replaced
-/+ resource "google_storage_bucket" "artifact_service" {
      - default_event_based_hold    = false -> null
      - enable_object_retention     = false -> null
      ~ id                          = "artifact-service-adk-docker-uv-302343a9" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "artifact-service-adk-docker-uv-302343a9" -> "adk-docker-uv-default-artifact-service-302343a9" # forces replacement
      ~ project                     = "doug-hayden-eng-sandbox" -> (known after apply)
      ~ project_number              = 136454482223 -> (known after apply)
      - requester_pays              = false -> null
      ~ rpo                         = "DEFAULT" -> (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/artifact-service-adk-docker-uv-302343a9" -> (known after apply)
      ~ time_created                = "2025-11-25T17:50:14.903Z" -> (known after apply)
      ~ updated                     = "2025-11-25T22:49:23.467Z" -> (known after apply)
      ~ url                         = "gs://artifact-service-adk-docker-uv-302343a9" -> (known after apply)
        # (7 unchanged attributes hidden)

      - hierarchical_namespace {
          - enabled = false -> null
        }

      ~ soft_delete_policy (known after apply)
      - soft_delete_policy {
          - effective_time             = "2025-11-25T17:50:14.903Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      ~ website (known after apply)

        # (1 unchanged block hidden)
    }

  # google_vertex_ai_reasoning_engine.session_and_memory will be updated in-place
  ~ resource "google_vertex_ai_reasoning_engine" "session_and_memory" {
      ~ description  = "Managed Session and Memory Bank Service" -> "Managed Session and Memory Bank Service for the adk-docker-uv-default app"
      ~ display_name = "Session and Memory: adk-docker-uv" -> "adk-docker-uv-default Sessions and Memory"
        id           = "projects/doug-hayden-eng-sandbox/locations/us-central1/reasoningEngines/1909328329912090624"
        name         = "1909328329912090624"
        # (3 unchanged attributes hidden)
    }

Plan: 10 to add, 1 to change, 10 to destroy.

Changes to Outputs:
  ~ artifact_service_uri             = "gs://artifact-service-adk-docker-uv-302343a9" -> (known after apply)
  ~ cloud_run_services               = {
      ~ us-central1 = {
          ~ latest_ready_revision = "adk-docker-uv-00010-4xd" -> (known after apply)
          ~ update_time           = "2025-11-26T23:34:42.658047Z" -> (known after apply)
          ~ uri                   = "https://adk-docker-uv-645mxjt3sq-uc.a.run.app" -> (known after apply)
        }
    }
  ~ configured_environment_variables = {
      ~ ARTIFACT_SERVICE_URI                       = "gs://artifact-service-adk-docker-uv-302343a9" -> (known after apply)
      + TELEMETRY_NAMESPACE                        = "default"
        # (11 unchanged attributes hidden)
    }
  ~ deployed_image                   = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/adk-docker-uv/adk-docker-uv@sha256:91a20700a9e06f073e2d386a1687d8353bff9cb78580ad869d489365833d2227" -> "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/adk-docker-uv/adk-docker-uv@sha256:468f9b891cb518e87342ea39dcae49699fb752001ad38441d0cc52aea2d569cb"
  ~ service_account_email            = "adk-docker-uv@doug-hayden-eng-sandbox.iam.gserviceaccount.com" -> "adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

---